---
kind: property
id: P:Autodesk.Revit.DB.TableCellCombinedParameterData.SampleValue
source: html/76a06a2b-4702-10ef-3a78-294394805da4.htm
---
# Autodesk.Revit.DB.TableCellCombinedParameterData.SampleValue Property

The sample/example value for the parameter in text form

## Syntax (C#)
```csharp
public string SampleValue { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null